r4d10n/hx-esp32-cam-fpv/esp32-gs/sdkconfig.defaults.uvc
# ESP32 FPV Ground Station SDK Configuration - UVC Only Mode
# This configuration uses usb_device_uvc component for standalone UVC webcam
# Without CDC/NCM networking (incompatible with usb_device_uvc)

# Target ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_ENABLE_PROMISCUOUS=y

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# PSRAM enabled (2MB QUAD PSRAM)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_CLK_IO=30
CONFIG_SPIRAM_CS_IO=26
CONFIG_SPIRAM_SPEED_80M=y

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# Console on UART (frees USB OTG)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB OTG Hardware
CONFIG_USB_OTG_SUPPORTED=y

# Disable esp_tinyusb CDC/NCM (conflicts with usb_device_uvc)
# CONFIG_TINYUSB_CDC_ENABLED is not set
# CONFIG_TINYUSB_NET_MODE_NCM is not set
CONFIG_TINYUSB_NET_MODE_NONE=y

# UVC Device Configuration (from usb_device_uvc component)
CONFIG_TUSB_VID=0x303A
CONFIG_TUSB_PID=0x8000
CONFIG_TUSB_MANUFACTURER="ESP32-FPV"
CONFIG_TUSB_PRODUCT="FPV Ground Station"

# Format: MJPEG
CONFIG_FORMAT_MJPEG_CAM1=y

# Frame size: VGA 640x480 (single resolution mode)
CONFIG_FRAMESIZE_VGA=y
CONFIG_UVC_CAM1_FRAMESIZE_WIDTH=640
CONFIG_UVC_CAM1_FRAMESIZE_HEIGT=480
CONFIG_UVC_CAM1_FRAMERATE=15

# Transfer mode: Isochronous (default, better compatibility)
CONFIG_UVC_MODE_ISOC_CAM1=y

# Disable multi-resolution (requires TinyUSB macros not in bundled version)
# CONFIG_UVC_CAM1_MULTI_FRAMESIZE is not set

# FPV GS Configuration - UVC only, no USB network
# CONFIG_FPV_GS_ENABLE_USB_NET is not set
CONFIG_FPV_GS_ENABLE_USB_UVC=y
CONFIG_FPV_GS_UVC_WIDTH=640
CONFIG_FPV_GS_UVC_HEIGHT=480
CONFIG_FPV_GS_UVC_FPS=15
# CONFIG_FPV_GS_UVC_BULK_MODE is not set

# Enable WiFi AP for web interface access (since USB network is disabled)
CONFIG_FPV_GS_ENABLE_WIFI_AP=y
